<a href="https://colab.research.google.com/github/ashishb321/ML-IMPLEMENTATIONS/blob/main/NAIVE_BAYES_CLASSIFER_TITANIC_DATASET_IMPLEMENTATION.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv("/content/titanic.csv")
df.head

<bound method NDFrame.head of      PassengerId  ... Survived
0              1  ...        0
1              2  ...        1
2              3  ...        1
3              4  ...        1
4              5  ...        0
..           ...  ...      ...
886          887  ...        0
887          888  ...        1
888          889  ...        0
889          890  ...        1
890          891  ...        0

[891 rows x 12 columns]>

In [ ]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace = True)
df.head

<bound method NDFrame.head of      Pclass     Sex   Age     Fare  Survived
0         3    male  22.0   7.2500         0
1         1  female  38.0  71.2833         1
2         3  female  26.0   7.9250         1
3         1  female  35.0  53.1000         1
4         3    male  35.0   8.0500         0
..      ...     ...   ...      ...       ...
886       2    male  27.0  13.0000         0
887       1  female  19.0  30.0000         1
888       3  female   NaN  23.4500         0
889       1    male  26.0  30.0000         1
890       3    male  32.0   7.7500         0

[891 rows x 5 columns]>

In [ ]:
inputs = df.drop('Survived',axis = 'columns')
target = df.Survived

In [ ]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [ ]:
inputs = pd.concat([inputs,dummies],axis ='columns')
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [ ]:
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [ ]:

inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [ ]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [ ]:

inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [ ]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [ ]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [ ]:
model.fit(X_train,y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

NameError: ignored

In [ ]:
model.score(X_test,y_test)

0.7873134328358209

In [ ]:
X_test[0:10]

     Pclass        Age      Fare  female
593       3  29.699118    7.7500       1
304       3  29.699118    8.0500       0
162       3  26.000000    7.7750       0
737       1  35.000000  512.3292       0
722       2  34.000000   13.0000       0
817       2  31.000000   37.0042       0
116       3  70.500000    7.7500       0
770       3  24.000000    9.5000       0
627       1  21.000000   77.9583       1
886       2  27.000000   13.0000       0

In [ ]:
y_test[0:10]

593    0
304    0
162    0
737    1
722    0
817    0
116    0
770    0
627    1
886    0
Name: Survived, dtype: int64

In [ ]:
model.predict(X_test[0:10])

array([1, 0, 0, 1, 0, 0, 0, 0, 1, 0])

In [ ]:

model.predict_proba(X_test[:10])

array([[3.61278175e-01, 6.38721825e-01],
       [9.62065003e-01, 3.79349966e-02],
       [9.59995314e-01, 4.00046861e-02],
       [1.02370120e-45, 1.00000000e+00],
       [9.23945162e-01, 7.60548384e-02],
       [9.04112592e-01, 9.58874081e-02],
       [9.26635973e-01, 7.33640268e-02],
       [9.58829092e-01, 4.11709076e-02],
       [1.12637466e-02, 9.88736253e-01],
       [9.18451992e-01, 8.15480080e-02]])

In [ ]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=5)

array([0.808     , 0.768     , 0.712     , 0.75      , 0.78225806])